Revit 2024 API
CutMarkType.CutMarkSymbol Property
 The symbol type of the cut mark.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public CutMarkSymbol CutMarkSymbol { get; set; }
Visual Basic
Public Property CutMarkSymbol As CutMarkSymbol
	Get
	Set
Visual C++
public:
property CutMarkSymbol CutMarkSymbol {
	CutMarkSymbol get ();
	void set (CutMarkSymbol value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
CutMarkType Class
Autodesk.Revit.DB.Architecture Namespace